In [1]:
/The first collumn we make will be the dates collumn

dates: 2018.01.01+1000000?31

In [89]:
/this counts all the dates in my table
count dates

1000000

In [90]:
/this will create a collumn that will hold 1 million values in a time variable
times: 1000000?24:00:00.0000
times

07:01:22.081 15:23:00.268 23:37:52.939 23:22:00.053 08:19:56.041 10:37:05.202..

In [91]:
/this will create a variable called quantities that will store 1 million random numbers that are multiples of 100 starting from 100
qtys:100*1+1000000?100
qtys

3600 9300 5400 7800 6300 1900 8600 3100 7100 2600 8600 6500 600 5900 6900 760..

In [93]:
/this will create a variable called indecies that will hold random 1 million values between 0 and 2 inclusive
idxs:1000000?3
idxs

2 0 2 1 1 1 1 0 1 2 2 2 0 1 2 0 2 1 2 1 0 1 2 2 2 1 0 2 0 2 0 2 2 0 0 0 2 2 1..

In [94]:
/using the indecies variable, the variable symbols will store the 3 elements listed below in the order of the indecies
symbs:`Schonfeld`JPMorgan`Barclays idxs

In [24]:
symbs

`Schonfeld`Schonfeld`Barclays`Barclays`JPMorgan`JPMorgan`Barclays`Barclays`Sc..

In [96]:
/this will create a price variable that will attach values to the indecies previously given
pxs:(1+1000000?0.3)* 430 230 120 idxs

In [80]:
pxs

527.0028 462.1679 155.348 139.85 256.6268 261.3949 142.1859 127.7479 487.3649..

In [97]:
/this will construct the table with the previous variables that have been initialised
t:([] date:dates;time:times;symb:symbs;qty:qtys;px:pxs)

In [82]:
t

date       time         symb      qty  px
-----------------------------------------------
2018.01.10 19:57:43.649 Schonfeld 7900 527.0028
2018.01.25 08:15:36.665 Schonfeld 9600 462.1679
2018.01.26 00:31:48.900 Barclays  3900 155.348
2018.01.20 21:38:21.927 Barclays  3000 139.85
2018.01.06 20:36:50.220 JPMorgan  8100 256.6268
2018.01.15 22:11:19.731 JPMorgan  3200 261.3949
2018.01.07 15:50:47.837 Barclays  4400 142.1859
2018.01.15 05:25:06.199 Barclays  6200 127.7479
2018.01.02 14:45:57.137 Schonfeld 3500 487.3649
2018.01.26 06:28:04.251 Schonfeld 700  526.8822
2018.01.08 20:47:08.643 Barclays  3800 148.6447
2018.01.05 05:02:14.346 JPMorgan  7500 236.5938
2018.01.09 05:50:43.964 Schonfeld 9600 540.5109
2018.01.04 04:21:49.401 Barclays  5400 151.6111
2018.01.10 19:55:52.363 JPMorgan  500  251.1744
2018.01.05 10:37:25.055 JPMorgan  200  240.6349
2018.01.09 22:24:19.182 JPMorgan  900  241.6722
2018.01.06 00:27:07.770 JPMorgan  1100 279.9315
2018.01.16 19:54:04.239 Schonfeld 700  439.9159
2018.01.04 17:27:16.560 JPMorgan  1600 284.5686
..

In [98]:
/this will print the table where time and date are ordered (time inside date)
t:`date`time xasc t

In [84]:
t

date       time         symb      qty  px
-----------------------------------------------
2018.01.01 00:00:05.227 Schonfeld 3300 505.0796
2018.01.01 00:00:07.136 JPMorgan  6900 270.9795
2018.01.01 00:00:08.200 JPMorgan  2200 256.4991
2018.01.01 00:00:16.846 Barclays  300  131.2755
2018.01.01 00:00:23.697 Schonfeld 4500 506.6416
2018.01.01 00:00:33.120 Barclays  6600 125.4023
2018.01.01 00:00:35.640 JPMorgan  7700 242.5132
2018.01.01 00:00:38.459 JPMorgan  7100 240.3508
2018.01.01 00:00:38.906 JPMorgan  6400 231.8265
2018.01.01 00:00:39.982 Schonfeld 6900 494.387
2018.01.01 00:00:41.775 Barclays  3600 151.0706
2018.01.01 00:00:44.185 Schonfeld 6100 548.5217
2018.01.01 00:00:49.859 Schonfeld 2100 463.616
2018.01.01 00:00:50.847 Barclays  4500 150.1267
2018.01.01 00:00:53.396 Barclays  5300 123.2618
2018.01.01 00:00:53.919 Barclays  6400 134.7235
2018.01.01 00:00:56.149 Schonfeld 2700 445.494
2018.01.01 00:00:57.381 JPMorgan  3700 268.4104
2018.01.01 00:01:04.472 Schonfeld 3300 509.3575
2018.01.01 00:01:06.507 Schonfeld 7800 520.4908
..

In [99]:
/this will print the first 5 rows of the table
5#t

date       time         symb      qty  px
-----------------------------------------------
2018.01.01 00:00:02.824 Barclays  5900 129.1832
2018.01.01 00:00:08.850 JPMorgan  7100 293.1494
2018.01.01 00:00:09.438 Schonfeld 4000 467.7574
2018.01.01 00:00:12.088 Schonfeld 8700 499.0621
2018.01.01 00:00:14.416 Schonfeld 1600 533.4486

In [86]:
select date, time, symb, px from t

date       time         symb      px
------------------------------------------
2018.01.01 00:00:05.227 Schonfeld 505.0796
2018.01.01 00:00:07.136 JPMorgan  270.9795
2018.01.01 00:00:08.200 JPMorgan  256.4991
2018.01.01 00:00:16.846 Barclays  131.2755
2018.01.01 00:00:23.697 Schonfeld 506.6416
2018.01.01 00:00:33.120 Barclays  125.4023
2018.01.01 00:00:35.640 JPMorgan  242.5132
2018.01.01 00:00:38.459 JPMorgan  240.3508
2018.01.01 00:00:38.906 JPMorgan  231.8265
2018.01.01 00:00:39.982 Schonfeld 494.387
2018.01.01 00:00:41.775 Barclays  151.0706
2018.01.01 00:00:44.185 Schonfeld 548.5217
2018.01.01 00:00:49.859 Schonfeld 463.616
2018.01.01 00:00:50.847 Barclays  150.1267
2018.01.01 00:00:53.396 Barclays  123.2618
2018.01.01 00:00:53.919 Barclays  134.7235
2018.01.01 00:00:56.149 Schonfeld 445.494
2018.01.01 00:00:57.381 JPMorgan  268.4104
2018.01.01 00:01:04.472 Schonfeld 509.3575
2018.01.01 00:01:06.507 Schonfeld 520.4908
..

In [101]:
/this will print the schema of the table
meta t

c   | t f a
----| -----
date| d   s
time| t
symb| s
qty | j
px  | f

In [102]:
/this will select parts of the table using the "where" clause
select date,time,qty,px from t where symb=`Schonfeld

date       time         qty  px
-------------------------------------
2018.01.01 00:00:09.438 4000 467.7574
2018.01.01 00:00:12.088 8700 499.0621
2018.01.01 00:00:14.416 1600 533.4486
2018.01.01 00:00:26.742 7800 464.8746
2018.01.01 00:00:35.642 4500 511.2477
2018.01.01 00:00:39.707 4100 492.2924
2018.01.01 00:00:50.339 3500 455.9788
2018.01.01 00:00:51.779 5900 516.3527
2018.01.01 00:00:56.853 9800 528.1093
2018.01.01 00:01:05.251 6400 547.0947
2018.01.01 00:01:13.315 8400 551.4501
2018.01.01 00:01:23.560 6100 519.5173
2018.01.01 00:01:27.407 5800 518.5333
2018.01.01 00:01:30.793 3400 431.6144
2018.01.01 00:01:34.462 4700 541.4484
2018.01.01 00:01:42.092 9500 509.7196
2018.01.01 00:01:44.127 3600 458.7331
2018.01.01 00:01:44.336 3200 442.4115
2018.01.01 00:01:47.956 600  446.9014
2018.01.01 00:01:50.295 8200 499.6826
..